import os
from YuiHirasawaMusicBot.config import ASSISTANT_NAME
from YuiHirasawaMusicBot.config import PROJECT_NAME
from YuiHirasawaMusicBot.config import SUPPORT_GROUP
from YuiHirasawaMusicBot.config import UPDATES_CHANNEL
class Messages():
      START_MSG = "**مرحبا 👋 [{}](tg://user?id={}) .**\n\n يمكنني تشغيل الموسيقي في قناتك او مجموعتك 😼\n\n- اكتب /help لعرض اوامر البوت."
      HELP_MSG = [
        ".",
f"""
**👋 مرحبًا بك مرة أخرى
⚪️ يمكنني تشغيل الموسيقى في الدردشة الصوتية لمجموعتك بالإضافة إلى الدردشات الصوتية للقناة 😸
⚪️ الحساب المساعد >> @{ASSISTANT_NAME} 😼\n\nانقر فوق التالي للحصول على التعليمات**
""",

f"""
**اعداد**
1) ارفع البوت مشرف في مجموعتك او قناتك
2) بدء تشغيل البوت
3) اكتب /تشغيل [اسم الاغنيه] يجب ادخال هذه الامر لاول مرا من قبل المسؤول
*) اذي انضم الحساب المساعد استمتع بي الموسيقي اذي (لم ينضم فا اضفه يدويا @{ASSISTANT_NAME})
**يمكنك تشغيل الموسيقي في القناه**
1) ارفع البوت مشرف في القناه
2) ارسل /userbotjoinchannel في المجموعة المرتبطه
3) ثم ارسل اوامر القناه في المجموعة المرتبطه
**الاوامر**
**=>> تشغيل موسيقي 🎧**
- /تشغيل: لي انضمام الحساب المساعد
- /تشغيل [رابط يوتيوب] : لي تشغيل موسيقي من يوتيوب
- /تشغيل [رد علي الصوت]: لي تشغيل موسيقي من المحادثه
- /ديزر تشغيل: لي تشغيل موسيقي عبر ديزر (اسم الاغنيه بي الانجليزي)
- /splay: لي تشغيل موسيقي عبر jio saavn
- /يوتيوب تشغيل: لي تشغيل موسيقي عبر يوتيوب
**=>> قائمه التشغيل ⏯**
- /التحكم: فتح قائمه الاعدادات
- /تخطي: تخطي الموسيقي الحاليا
- /توقف: ايقاف مؤقت
- /استئناف: استئناف الموسيقي
- /انهاء: الانهاء الموسيقي
- /عرض القائمه: يعرض مسار التشغيل الحالي
- /عرض: يظهر قائمة التشغيل
""",
        
f"""
**=>> مشغل موسيقي القنوات 🛠**
⚪️ لمسؤولي المجموعة المرتبطة فقط:
- /القناة تشغيل [اسم الموسيقي] - لي تشغيل موسيقي
- /القناة ديزر تشغيل [اسم الموسيقي] - لي تشغيل موسيقي من الديزر
- /csplay [اسم الموسيقي] - لي تشغيل موسيقي من jio saavn
- /القناة قائمة التشغيل - عرض قائمة التشغيل
- /القناة مسار - عرض مسار التشغيل الحالي
- /القناة التحكم - فتح قائمة التحكم
- /القناة توقف - ايقاف مؤقت
- /القناة استئناف - استئناف التشغيل
- /القناة تخطي - تخطي الموسيقي
- /القناة انهاء - انهاء الموسيقي
- /القناة انضم - انضمام الحساب المساعد لي القناه المرتبطه
""",

f"""
**=>> مزيد من الادوات 🧑‍🔧**
- /الموسيقي [on/off]: تفعيل/تعطيل : لي تفعيل و تعطيل مشغل الموسيقي
- /تحديث: لي تحديث قائمه المشرفين في المجموعه
- /انضم: لي دعوه الحساب المساعد الي المجموعه @{ASSISTANT_NAME}
- /تحميل: لي تحميل اغنية من يوتيوب
**=>> اوامر المطورين ⚔️**
 - /مغادره - لي مغادره الحساب المساعد من جميع الدردشات
 - /اذاعه <بي الرد علي رساله> - يقوم الحساب المساعد بي ارساله لي جميع المحادثات
 - /الردود [on/off] - تفعيل/تعطيل رد الخاص
*يمكن للمطورين استخدام اي امر في المجموعة
"""
      ]
